000100 *FizzBuzz in Cobol
000200   IDENTIFICATION DIVISION.
000300     PROGRAM-ID. FIZZBUZZ.

000400   DATA DIVISION.
000500     WORKING-STORAGE SECTION.
000600      01 WS-NUM PIC 9(2) VALUE 0.
000700      01 WS-MOD-THRE PIC 9.
000800      01 WS-MOD-FIVE PIC 9.

000900   PROCEDURE DIVISION.
001000     MAIN-PARA.
001100       PERFORM LOOP-PARA 20 TIMES.
001200       STOP RUN.
001300      
001400     LOOP-PARA.
001500       SET WS-NUM UP BY 1.
001600       COMPUTE WS-MOD-THRE = FUNCTION MOD ( WS-NUM, 3 ).
001700       COMPUTE WS-MOD-FIVE = FUNCTION MOD ( WS-NUM, 5 ).

001800       IF WS-MOD-THRE = 0 AND WS-MOD-FIVE = 0 THEN
001900         DISPLAY "FIZZBUZZ".
002000       IF WS-MOD-THRE = 0 THEN
002100         DISPLAY "FIZZ".

002200       IF WS-MOD-FIVE = 0 THEN
002300         DISPLAY "BUZZ".

002400       IF NOT WS-MOD-THRE = 0 AND NOT WS-MOD-FIVE = 0 THEN
002500         DISPLAY WS-NUM.
002600   STOP RUN.